<details><summary>Plan: 4 to add, 1 to change, 0 to destroy.</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
~   update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.tts-10x-forms-dev-sandbox_tts-10x-forms-dev-sandbox-app_DC6398B6 will be created
+   resource "cloudfoundry_app" "tts-10x-forms-dev-sandbox_tts-10x-forms-dev-sandbox-app_DC6398B6" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/forms/sandbox:e26cbb9e24b09f405a7767d5ad0efce29af0be7b"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-forms-dev-sandbox-app"
+       ports                           = (known after apply)
+       space                           = "95f25610-2fa4-4e67-b5b1-aa9e3b7f5edf"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 300

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }

+       service_binding {
+           service_instance = (known after apply)
        }
+       service_binding {
+           service_instance = (known after apply)
        }
    }

  # cloudfoundry_app.tts-10x-forms-dev-server-doj_tts-10x-forms-dev-server-doj-app_22D74DC4 will be updated in-place
~   resource "cloudfoundry_app" "tts-10x-forms-dev-server-doj_tts-10x-forms-dev-server-doj-app_22D74DC4" {
~       docker_image                    = "ghcr.io/gsa-tts/forms/server-doj:4d297c0c612db2b97f8daf5e777d728a8ca02447" -> "ghcr.io/gsa-tts/forms/server-doj:e26cbb9e24b09f405a7767d5ad0efce29af0be7b"
        id                              = "8ad75c3a-28fa-430c-b723-404e19b35de8"
        name                            = "tts-10x-forms-dev-server-doj-app"
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # cloudfoundry_route.tts-10x-forms-dev-sandbox_tts-10x-forms-dev-sandbox-route_E8876A9F will be created
+   resource "cloudfoundry_route" "tts-10x-forms-dev-sandbox_tts-10x-forms-dev-sandbox-route_E8876A9F" {
+       domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
+       endpoint = (known after apply)
+       hostname = "tts-10x-forms-dev-sandbox"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "95f25610-2fa4-4e67-b5b1-aa9e3b7f5edf"
    }

  # cloudfoundry_service_instance.tts-10x-forms-dev-sandbox_tts-10x-forms-dev-sandbox-db_D55690E4 will be created
+   resource "cloudfoundry_service_instance" "tts-10x-forms-dev-sandbox_tts-10x-forms-dev-sandbox-db_D55690E4" {
+       id                             = (known after apply)
+       json_params                    = jsonencode(
            {
+               version = "15"
            }
        )
+       name                           = "tts-10x-forms-dev-sandbox-db"
+       replace_on_params_change       = false
+       replace_on_service_plan_change = false
+       service_plan                   = "5ed9f319-4c75-4851-9885-598a96b7febc"
+       space                          = "95f25610-2fa4-4e67-b5b1-aa9e3b7f5edf"

+       timeouts {
+           create = "60m"
+           delete = "2h"
+           update = "60m"
        }
    }

  # cloudfoundry_user_provided_service.tts-10x-forms-dev-sandbox_tts-10x-forms-dev-sandbox-login-gov-service_9040363D will be created
+   resource "cloudfoundry_user_provided_service" "tts-10x-forms-dev-sandbox_tts-10x-forms-dev-sandbox-login-gov-service_9040363D" {
+       credentials = (sensitive value)
+       id          = (known after apply)
+       name        = "tts-10x-forms-dev-sandbox-login-gov-service"
+       space       = "95f25610-2fa4-4e67-b5b1-aa9e3b7f5edf"
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```
</details>

<!-- Sticky Pull Request Commentterraform-plan -->